# connect-api - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.aws_lambda.data.archive_file.default: Reading...
module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/connect_api]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=dahoa3t425]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Reading...
module.common_resources.data.aws_cognito_user_pools.user_pool: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda.aws_iam_role.lambda_role: Refreshing state... [id=le-connect_api]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Read complete after 0s [id=upstash_kafka_cluster_credential_id]
module.common_resources.data.upstash_kafka_credential_data.default: Reading...
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=713821e5-fed9-4082-a0c7-406a4f9b0c57:connect_api]
module.common_resources.data.aws_cognito_user_pools.user_pool: Read complete after 0s [id=staging]
module.common_resources.data.curl.cognito_user_pool_keys: Reading...
module.common_resources.data.curl.cognito_user_pool_keys: Read complete after 0s [id=1685517072]
module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=le-connect_api-20230527203500816700000001]
module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/connect_api]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Read complete after 0s [id=upstash-cluster-cd2221c9-e9d6-4e4b-b87a-503beb130df1]
module.common_resources.data.upstash_kafka_credential_data.default: Read complete after 0s [id=upstash-kafka-credential-42067792-8b6c-4c27-b34e-d1daed82d943]
module.common_resources.module.aws_lambda.data.archive_file.default: Read complete after 1s [id=9a90fdd02767fd99023c2cbb846cd693435deda2]
module.common_resources.module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=connect_api]
module.common_resources.module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=9i13ayt]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_route.any["all"]: Refreshing state... [id=x5uyupe]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default will be updated in-place
  ~ resource "aws_apigatewayv2_api" "default" {
        id                           = "dahoa3t425"
        name                         = "connect_api"
        tags                         = {
            "domain"        = "connect"
            "environment"   = "staging"
            "resource"      = "connect-api"
            "resource_type" = "api_gateway"
        }
        # (8 unchanged attributes hidden)

      ~ cors_configuration {
          ~ allow_credentials = false -> true
            # (5 unchanged attributes hidden)
        }
    }

  # module.common_resources.module.aws_lambda.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "connect_api"
        tags                           = {
            "domain"        = "connect"
            "environment"   = "staging"
            "resource"      = "connect-api"
            "resource_type" = "lambda"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS"                           = "precious-raccoon-9266-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"                                 = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"                                  = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"                                    = "115af9d0060146689ccdfbd8a39688e2"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"                              = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"                                    = "cHJlY2lvdXMtcmFjY29vbi05MjY2JPUcwBKiDajJ1_PyzpCvK5iTwQi8olRl9UA"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"                                 = (sensitive value)
              - "CONNECTILLY_SECURITY_TOKEN_IDENTITY_PROVIDER_DEFAULT_KEYS"             = jsonencode(
                    {
                      - keys = [
                          - {
                              - alg = "RS256"
                              - e   = "AQAB"
                              - kid = "KT+tjKcoV6hc8VHdxjy2pRm1TWSgq+y3NoexhXtD5zc="
                              - kty = "RSA"
                              - n   = "u4PgK0Hl6hila-vFNszgZIz9dQSmHgIW9P02WjC4gyAlYvj9V9zJgPVoZNOZYe263ZyK5NCaZgVv2kHG3XAg7eQhYKPBFnOW8HsphTtp6gVitMSDZn_a6GHBXzedcW6MSE0iUrOCM3qaGMo8atyOQc5Y_sWpnreJotxYi2-kG4zLF1sUuijoc7oSryffo8ZGRWnZEhf_MVWb4CoAykE6rTIHgyh-uEX8XLRiTfyeMRhf-BZ1nZxLQAbaVySJ95l4jqq54JuG0D5EEX34sg5wrUENJTLtNfkYw_w5mcUo6ADFevgXRuGgZuoBKBlgUa0GOq8JbkPq2Z-Rfjlj8E9t1w"
                              - use = "sig"
                            },
                          - {
                              - alg = "RS256"
                              - e   = "AQAB"
                              - kid = "7rriMR7gGebl1RrnISCH2DxEaYGVJf+9K2/OHC3RMK8="
                              - kty = "RSA"
                              - n   = "zumg9yY37PSR_3-A46CgOztLvPHnUl19fEoOFC9VTrdz8Gi8hwL6I4lTPUH_n6w3_wRgIaPrATV9HsJBU9ZqYfJqVLniNa8MZ9A7rqsrqU2I-5rOoQi52u-FgJ-QLIdfv6-IxPl-KB4kZe27a31hFne9e6n1vI2kf1x5NTYpcLekNOY2L6qriz7BcD0Of6Q1ZNVQYe5dE2ilZHLMwmEhKBNOhppgp2cz9MxtT5CLjHBpz8--aKS8fo1zOO7y160lvjlGqzxU8UQRIEVrcfFdHFoVq3V2bp0HNL3pOjdzWokSxHSvLFanzcXKB0a54ELmHcH_n_l1OTzHUysFs8JlxQ"
                              - use = "sig"
                            },
                        ]
                    }
                )
              - "CONNECTILLY_SECURITY_TOKEN_IDENTITY_PROVIDER_DEFAULT_REFRESH_RSA_KEYS" = "false"
              - "CONNECTILLY_SECURITY_TOKEN_IDENTITY_PROVIDER_URL"                      = "https://cognito-idp.us-east-1.amazonaws.com/us-east-1_NSm4qy3ZB/.well-known/jwks.json"
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "connect"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "connect_api"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "713821e5-fed9-4082-a0c7-406a4f9b0c57:connect_api"
        name       = "connect_api"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "0f0502ef-4dbf-49e5-9755-b28a17bca2ac" -> "85d60c65-dc0f-4879-941a-7398c96c79a1"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*